Revit 2026 API

# FailureDefinitionAccessor Class

---

A class that provides access to the details of a FailureDefinition after the definition has been defined.

SystemObject Autodesk.Revit.DBFailureDefinitionAccessor

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FailureDefinitionAccessor : IDisposable
```
```vb
Public Class FailureDefinitionAccessor
	Implements IDisposable
```
```cpp
public ref class FailureDefinitionAccessor : IDisposable
```
```fsharp
type FailureDefinitionAccessor =
    class
        interface IDisposable
    end
```

The FailureDefinitionAccessor type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FailureDefinitionAccessor |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetApplicableResolutionTypes | Retrieves a list of resolution types applicable to the failure. |
|  | GetDefaultResolutionType | Retrieves the default resolution type for the failure. |
|  | GetDescriptionText | Retrieves the description text of the failure. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetId | Retrieves the unique identifier of the FailureDefinition. |
|  | GetResolutionCaption | Retrieves the caption for a specific resolution type. |
|  | GetSeverity | Retrieves severity of the failure. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | HasResolutions | Checks if the FailureDefinition has at least one resolution. |
|  | IsResolutionApplicable | Checks if the given resolution type is applicable to the failure. |
|  | SetDefaultResolutionType | Sets the default resolution type for the failure. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace